DanilovSoft/ShowerSTM32/stm32-shower/TempSensorTask.h
#pragma once

/////////////////////////////////////////   Общие коменды   //////////////////////////////////////////////////////////////////
/*

0xF0 —
            Перечисление ID устройств (Поиск ROM (Search ROM))
            Команда выдается управляющим микроконтроллером для определения 
            числа и типа термодатчиков, подключенных к одной линии.

0x33 — 
            Чтение ID единственного подключенного устройства		(Чтение ROM (Read ROM))
            Данная команда инициализирует термодатчик для генерации в линию 
            идентификационного номера. Эту команду нельзя посылать, если к одной линии 
            связи подключено несколько термодатчиков. Прежде чем подключить 
            несколько датчиков на одну линию, необходимо для каждого датчика определить 
            его личный номер с использованием данной команды.

0x55 — 
            Поиск устройства по ID (Идентификация ROM (Match ROM))
            Команда выдается перед 64-битным идентификационным номером и подтверждает 
            обращение именно к этому термодатчику. Все последующие команды будут 
            восприниматься только одним датчиком до команды обнуления линии.

0xCC — 
            Обращение ко всем устройствам (пропуск ID) (Пропуск ROM (Skip ROM))
            Команда может использоваться, когда необходимо обратиться ко всем датчикам, 
            расположенным на одной линии, или когда к линии подключен только один датчик. 
            Общей для многих датчиков может быть команда начала преобразования температуры. 
            При обращении к одному термодатчику команда позволяет 
            упростить программу (следовательно, и время цикла) за счет того, что пропускается 
            громоздкая подпрограмма идентификации кода и вычисления кода четности.

0xEC — 
            Поиск устройств, установивших флаг 'тревога' (Поиск аварии (Alarm Search))
            Действие команды аналогично команде «Поиск ROM», но отвечает на нее термодатчик, 
            если измеренная температура выходит за пределы предварительных установок 
            по максимуму и минимуму.

*/
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/////////////////////////////////// Команды DS18S20 //////////////////////////////////////////////////////////////////////
/*

0x44 —
            Начало преобразования температуры (Convert Т)
            Команда разрешает преобразование температуры и запись результата в блокнот.
            От подачи этой команды до считывания необходимо выдержать паузу, 
            необходимую для преобразования с установленной точностью.

0xBE —
            Чтение блокнота (Read Scratchpad)
            В блокноте содержится 8 байт информации. Если нужна информация только о температуре, то 
            считывается 9 бит. Термодатчик будет выдавать информацию до тех пор, пока управляющий 
            микроконтроллер не выдаст в линию нулевой импульс.

0x4E —
            Запись в блокнот (Write Scratchpad)
            После этой команды управляющий микроконтроллер должен послать два байта для записи в блокнот 
            максимальной ТН и минимальной TL температуры ограничения по максимуму и минимуму. 
            Все 16 бит необходимо передавать непрерывно без обнуления линии.

0x48 —
            Копирование блокнота (Copy Scratchpad)
            После этой команды минимальная (TL) и максимальная (ТН) установленные значения температур 
            переписываются в энергонезависимую память (EEPROM). После отключения напряжения 
            питания записанные значения сохранятся в памяти.

0xB8 —
            Восстановление (Recall Е2)
            Эта команда необходима для копирования значений температуры из EEPROM в рабочую зону 
            блокнота. При выполнении восстановления термодатчик выдает в линию низкий 
            уровень, а после окончания записи — высокий.

0xB4 —
            Питание от линии (Read Power Supply)
            После этой команды термодатчик переходит к питанию от линии. 
            В составе термодатчика имеется конденсатор, который заряжается от высокого 
            уровня линии. Перед опросом термодатчика управляющим микроконтроллером 
            необходимо выдержать время, необходимое для заряда конденсатора.
*/
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include "TaskBase.h"
#include "Properties.h"
#include "stm32f10x.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_dma.h"
#include "Common.h"
#include "Properties.h"
#include "Common.h"
#include "string.h"
#include "EepromHelper.h"
#include "InitializationTask.h"
#include "PropertyWrapper.h"

class TempSensorTask final : public TaskBase
{
public:

    void Init()
    {
        Debug::Assert(g_properties.Initialized);
        
        // Готовим команду — чтение памяти устройства.
        memcpy(m_internalDeviceReadScratchCommand + 1, g_properties.InternalTempSensorId, 8);
        memcpy(m_externalDeviceReadScratchCommand + 1, g_properties.ExternalTempSensorId, 8);
    }
    
    void WaitFirstConversion()
    {
        while (!m_internalSensorInitialized || !m_airSensorInitialized) 
        {
            taskYIELD();
        }
    }

    bool TryGetAirTemp(float& air_temp)
    {
        if (m_airSensorInitialized)
        {	
            float air_temp = m_averageAirTemp;
            return true;
        }
        return false;
    }
    
    bool GetInternalSensorInitialized() volatile
    {
        return m_internalSensorInitialized;
    }
    
    bool GetAirSensorInitialized() volatile
    {
        return m_airSensorInitialized;
    }
    
    bool GetRegisteringSensors() volatile
    {
        return m_registeringSensors;
    }
    
    // Усреднённое показание с датчика в баке.
    float GetAverageInternalTemp() volatile
    {
        return m_averageInternalTemp;
    }
    
    // Усреднённое показание датчика укружающего воздуха.
    float GetAverageAirTemp() volatile
    {
        return m_averageAirTemp;
    }
    
    // Последнее показание с датчика в баке.
    float GetInternalTemp() volatile
    {
        return m_internalTemp;
    }
    
    // Последнее показание с датчика окружающего воздуха.
    float GetAirTemp() volatile
    {
        return m_airTemp;
    }
    
