DanilovSoft/ShowerSTM32/stm32-shower/TempSensorTask.h
        return true;
    }

    bool SaveResolution(const DS18B20_Resolution resolution, const uint8_t* device_id)
    {
        // Нужно записать в устройство новые параметры.

        uint8_t setResolutionCommand[] =
        { 
            MATCH_ROM,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            WRITE_SCRATCHPAD,
            TH_REGISTER,
            TL_REGISTER,
            (uint8_t)resolution,
        };
        
        memcpy(setResolutionCommand + 1, device_id, 8);
        
        if (!OneWireSend(setResolutionCommand, 13))
        {
            return false;
        }
        
        //	// Восстанавливаем из EEPROM.
        //	uint8_t recallCommand[] = 
        //	{
        //		MATCH_ROM,
        //		0,
        //		0,
        //		0,
        //		0,
        //		0,
        //		0,
        //		0,
        //		0,
        //		RECALL_E2
        //	};
        //			
        //	memcpy(recallCommand + 1, deviceId, 8);
        //			
        //	if (!OneWire_Send(recallCommand, 10))
        //	{
        //		return false;
        //	}
        //			
        //	vTaskDelay(1000 / portTICK_PERIOD_MS);
        //			
        //	// Читаем память устройства с проверкой контрольной суммы.
        //	if(!OneWire_Send(, 10, scratchpad, 9, true))
        //	{
        //		return false;
        //	}
        
            // Теперь скопировать в EEPROM устройства.
            uint8_t copyScratchpadCommand[] = 
        { 
            MATCH_ROM,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            COPY_SCRATCHPAD
        };
        
        memcpy(copyScratchpadCommand + 1, device_id, 8);

        if (!OneWireSend(copyScratchpadCommand, 10))
        {
            return false;
        }
        
        // Не уверен что это нужно но лучше подождать запись в EEPROM.
        vTaskDelay(20 / portTICK_PERIOD_MS);

        return true;
    }

    // Если датчики заменить на новые то потребуется зарегистрировать их идентификаторы.
    void TryRegisterNewSensors()
    {
        uint8_t one_dev_repeat_count = 0;
        uint8_t two_dev_repeat_count = 0;
        uint8_t new_internal_sensor[8] = { };
        uint8_t new_air_sensor[8] = { };
    
repeat:
    
        uint8_t devices[16] = {};
        uint8_t dev_count = OneWireScan(devices, 2);
    
        // Если в списке только одно устройство и оно новое то зарегистрировать как датчик для бака.
        if(dev_count == 1)
        {
            bool is_internal_sensor = Common::ArrayEquals(devices, 8, g_properties.InternalTempSensorId, 8);
        
            if (!is_internal_sensor)
            {
                bool is_air_sensor = Common::ArrayEquals(devices, 8, g_properties.ExternalTempSensorId, 8);
            
                if (!is_air_sensor)
                {
                    // На шине обнаружено только одно устройство и оно новое.
                    // Значит нужно зарегистрировать его как основной датчик бака.
                    // Но ситуация может быть ошибочной поэтому уведомляем пользователя 
                    // и выдерживаем паузу что-бы пользователь мог прервать перезапись идентификатора.
                
                    if(one_dev_repeat_count == 0)
                    {
                        one_dev_repeat_count++;
                    
                        memcpy(new_internal_sensor, devices, 8);      // Запомним ид устройства что-бы сравнить при повторной попытке.
                    
                        m_registeringSensors = true;
                
                        vTaskDelay(10000 / portTICK_PERIOD_MS);
                    
                        // Повторим поиск устройств что-бы дополнительно убедиться что ситуация не ошибочная.
                        goto repeat;
                    }
                    else
                    {
                        if (!Common::ArrayEquals(devices, 8, new_internal_sensor, 8))
                        {
                            // Идентификатор изменился - что-то пошло не так. Не будем переписывать значение.
                            return;
                        }
                    
                        memcpy(g_writeProperties.InternalTempSensorId, new_internal_sensor, 8);
                
                        if (Common::ArrayEquals(g_writeProperties.InternalTempSensorId, 8, g_writeProperties.ExternalTempSensorId, 8))
                        {
                            memset(g_writeProperties.ExternalTempSensorId, 0, 8);
                        }
                    
                        // Перезаписываем идентификатор датчика.
                        g_eepromHelper.Save();
                    
                        // Пока никто не работает с этим идентификатором можем безопасно перезаписать (не атомарно).
                        // TODO не очень хорошо модифицировать здесь.
                        memcpy(g_properties.InternalTempSensorId, new_internal_sensor, 8);
                    }
                }
            }
        }
        else if(dev_count == 2)
        {
            // Если устройств 2, где один это датчик бака, а другое новое то зарегистрировать второй как датчик окружающего воздуха.

            // Является ли первое устройство в массиве датчиком бака.
            bool firstIsInternal = Common::ArrayEquals(devices, 8, g_properties.InternalTempSensorId, 8);
        
            bool secondIsInternal;
        
            if (firstIsInternal)
            {
                secondIsInternal = false;
            }
            else
            {
                secondIsInternal = Common::ArrayEquals(devices + 8, 8, g_properties.InternalTempSensorId, 8);
            }
        
            if (firstIsInternal || secondIsInternal)
            {
                uint8_t* nextDev = firstIsInternal ? devices + 8 : devices;
            
                if (!Common::ArrayEquals(nextDev, 8, g_properties.ExternalTempSensorId, 8))
                {
                    // Обнаружен новый датчик. Предупредим пользователя, выдержим паузу, перечитаем идентификатор и зарегистрируем его как датчик воздуха.
                
                    if(two_dev_repeat_count == 0)
                    {
                        two_dev_repeat_count++;
                    
                        memcpy(new_air_sensor, nextDev, 8);         // Запомним ид устройства что-бы сравнить при повторной попытке.
                    
                        m_registeringSensors = true;
                
                        vTaskDelay(10000 / portTICK_PERIOD_MS);
                    
                        // Повторим поиск устройств что-бы дополнительно убедиться что ситуация не ошибочная.
                        goto repeat;
                    }
                    else
                    {
                        if (!Common::ArrayEquals(nextDev, 8, new_air_sensor, 8))
                        {
                            // Идентификатор изменился - что-то пошло не так. Не будем переписывать значение.
                            return;
                        }
                    
                        memcpy(g_writeProperties.ExternalTempSensorId, new_air_sensor, 8);
                
                        // Перезаписываем идентификатор датчика.
                        g_eepromHelper.Save();
                    
