DanilovSoft/ShowerSTM32/stm32-shower/TempSensorTask.h
    bool TryGetFirstTemps()
    {
        uint8_t scratchpad[9];
        bool internalSuccess = false;
    
        // PS. У датчиков по умолчанию значение температуры = 85 градусов С.
    
        if(OneWireSend(AllDevicessStartConvert, 2))
        {
            vTaskDelay(kMinimumDelayMsec / portTICK_PERIOD_MS);	
        
            float internal_temp;
            if (TryGetInternalTemp(internal_temp))
            {
                m_internalTemp = internal_temp;
                InitAverageInternalTemp(internal_temp);  // Заполнить скользящий буфер первым измерением.
                m_averageInternalTemp = internal_temp;
                m_internalSensorInitialized = true;
            }
        
            float externalTemp;
            if (TryGetExternalTemp(externalTemp))
            {
                m_airTemp = externalTemp;
                InitAverageExternalTemp(externalTemp);  // Заполнить скользящий буфер первым измерением.
                m_averageAirTemp = externalTemp;
                m_airSensorInitialized = true;
            }
        }
        return m_internalSensorInitialized && m_airSensorInitialized;
    }

    bool TryGetInternalTemp(float& internal_temp)
    {
        uint8_t scratchpad[9];
        
        // Читаем блокнот конкретного устройства.
        if(OneWireSend(m_internalDeviceReadScratchCommand, 10, scratchpad, 9, true))
        {
            // Значение COUNT_PER_°C должно равняться заданной разрядности.
            uint8_t count_per_c = scratchpad[7];
            if (count_per_c == kCountPerC)
            {
                internal_temp = Decode(scratchpad);
                return true;
            }
        }
        return false;
    }

    bool TryGetExternalTemp(float& air_temp)
    {
        uint8_t scratchpad[9];
    
        if (OneWireSend(m_externalDeviceReadScratchCommand, 10, scratchpad, 9, true))
        {
            uint8_t count_per_c = scratchpad[7];
            if (count_per_c == kCountPerC)
            {
                air_temp = Decode(scratchpad);
                return true;
            }
        }
        return false;
    }

    // Заполняет весь скользящий буфер одним значением.
    void InitAverageInternalTemp(const float internal_temp)
    {
        m_intTempSum = internal_temp * g_properties.InternalTempAvgFilterSize;
        for (size_t i = 0; i < g_properties.InternalTempAvgFilterSize; i++)
        {
            m_intTempBuf[i] = internal_temp;
        }
        m_intTempHead = 0;
    }

    // Заполняет весь скользящий буфер одним значением.
    void InitAverageExternalTemp(const float external_temp)
    {
        m_extTempSum = external_temp * kAirTempAvgFilterSize;
        for (size_t i = 0; i < kAirTempAvgFilterSize; i++)
        {
            m_extTempBuf[i] = external_temp;
        }
        m_extTempHead = 0;
    }
    
    // Данная функция осуществляет сканирование сети 1-wire и записывает найденные
    // ID устройств в массив buf, по 8 байт на каждое устройство.
    // @param num Переменная num ограничивает количество находимых устройств, чтобы не переполнить буфер.
    uint8_t OneWireScan(uint8_t* devices, uint8_t num) 
    {
        uint8_t found = 0;
        uint8_t* last_device;
        uint8_t* cur_device = devices;
        uint8_t num_bit, last_collision, current_collision, current_selection;

        static constexpr uint8_t search_rom_command[1] = { SEARCH_ROM };
    
        last_collision = 0;
        while (found < num) 
        {
            num_bit = 1;
            current_collision = 0;

            // Посылаем команду на поиск устройств.
            OneWireSend(search_rom_command, 1, 0, 0);
        
            for (num_bit = 1; num_bit <= 64; num_bit++) 
            {
                // Читаем два бита. Основной и комплементарный.
                OneWireByteToBits(kOneWireReadSlot, m_oneWireBuffer);
                Common::OneWireSendBits((uint32_t)m_oneWireBuffer, 2);

                if (m_oneWireBuffer[0] == kOneWireR1) 
                {
                    if (m_oneWireBuffer[1] == kOneWireR1) 
                    {
                        // Две единицы, где-то провтыкали и заканчиваем поиск.
                        return found;
                    }
                    else 
                    {
                        // 10 - на данном этапе только 1.
                        current_selection = 1;
                    }
                }
                else 
                {
                    if (m_oneWireBuffer[1] == kOneWireR1) 
                    {
                        // 01 - на данном этапе только 0.
                        current_selection = 0;
                    }
                    else 
                    {
                        // 00 - коллизия.
                        if(num_bit < last_collision) 
                        {
                            // идем по дереву, не дошли до развилки.
                            if(last_device[(num_bit - 1) >> 3] & 1 << ((num_bit - 1) & 0x07)) 
                            {
                                // (numBit-1)>>3 - номер байта.
                                // (numBit-1)&0x07 - номер бита в байте.
                                current_selection = 1;

                                // если пошли по правой ветке, запоминаем номер бита.
                                if(current_collision < num_bit) 
                                {
                                    current_collision = num_bit;
                                }
                            }
                            else 
                            {
                                current_selection = 0;
                            }
                        }
                        else 
                        {
                            if (num_bit == last_collision) 
                            {
                                current_selection = 0;
                            }
                            else 
                            {
                                // идем по правой ветке.
                                current_selection = 1;

