DanilovSoft/ShowerSTM32/stm32-shower/TempSensorTask.h
                                // если пошли по правой ветке, запоминаем номер бита.
                                if(current_collision < num_bit) 
                                {
                                    current_collision = num_bit;
                                }
                            }
                        }
                    }
                }

                if (current_selection == 1) 
                {
                    cur_device[(num_bit - 1) >> 3] |= 1 << ((num_bit - 1) & 0x07);
                    OneWireByteToBits(0x01, m_oneWireBuffer);
                }
                else 
                {
                    cur_device[(num_bit - 1) >> 3] &= ~(1 << ((num_bit - 1) & 0x07));
                    OneWireByteToBits(0x00, m_oneWireBuffer);
                }
                Common::OneWireSendBits((uint32_t)m_oneWireBuffer, 1); // Читаем один бит.
            }
            found++;
            last_device = cur_device;
            cur_device += 8;
            if (current_collision == 0)
            {
                return found;
            }

            last_collision = current_collision;
        }
        return found;
    }

    

    uint8_t GetDevider(DS18B20_Resolution resolution) 
    {
        uint8_t devider;
        switch (resolution) 
        {
        case DS18B20_Resolution_9_bit:
            devider = 8;
            break;
        case DS18B20_Resolution_10_bit:
            devider = 4;
            break;
        case DS18B20_Resolution_11_bit:
            devider = 2;
            break;
        case DS18B20_Resolution_12_bit:
        default:
            devider = 1;
            break;
        }

        return devider;
    }
};

extern TempSensorTask g_tempSensorTask;
